In [1]:
import pandas as pd

In [2]:
s = pd.Series([10, 20, 30, 40, 50])
print(s)

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [3]:
s = pd.Series([10, 20, 30, 40, 50], index=["a", "b", "c", "d", "e"])
print(s)

a    10
b    20
c    30
d    40
e    50
dtype: int64

In [4]:
data = {"Math" : 90, "Science" : 85, "English" : 95}
marks = pd.Series(data)
print(data)

{'Math': 90, 'Science': 85, 'English': 95}

In [5]:
print(marks)

Math       90
Science    85
English    95
dtype: int64

In [6]:
data = {"Name" : ["Alice", "Bob", "Charlie"], "Age" : [25, 30, 35], "Marks" : [85, 90, 78]}
print(data)
type(data)

{'Name': ['Alice', 'Bob', 'Charlie'], 'Age': [25, 30, 35], 'Marks': [85, 90, 78]}

dict

In [7]:
# pandas automatically adds a default index: This is called a RangeIndex(start from 0 by default)
marks = pd.DataFrame(data)
print(marks)

      Name  Age  Marks
0    Alice   25     85
1      Bob   30     90
2  Charlie   35     78

In [8]:
# we can add a custom index to the DataFrame
marks = pd.DataFrame(data, index=["Student1", "Student2", "Student3"])
print(marks)

             Name  Age  Marks
Student1    Alice   25     85
Student2      Bob   30     90
Student3  Charlie   35     78

In [9]:
marks.set_index("Name", inplace=True)
 # if we are setting inplace = true it means we are changing the original object itself .if we do not set inplace = true then we have to assign the result to a new variable or to the same variable to see the changesprint(marks)

In [10]:
df = pd.DataFrame(data)
print(df)

      Name  Age  Marks
0    Alice   25     85
1      Bob   30     90
2  Charlie   35     78

In [11]:
df.head()

      Name  Age  Marks
0    Alice   25     85
1      Bob   30     90
2  Charlie   35     78

In [12]:
df.tail()

      Name  Age  Marks
0    Alice   25     85
1      Bob   30     90
2  Charlie   35     78

In [13]:
df = pd.DataFrame({"Name": ["Aman","Amit","Ankit","Ankush","Abhishek","Abhi"], "Age": [25, 30, 35, 40, 45, 50], "Marks": [85, 90, 78, 88, 92, 80]})

In [14]:
print(df.head(2))
print(df.tail(2))

   Name  Age  Marks
0  Aman   25     85
1  Amit   30     90
       Name  Age  Marks
4  Abhishek   45     92
5      Abhi   50     80

In [15]:
df.shape

(6, 3)

In [16]:
df.columns

Index(['Name', 'Age', 'Marks'], dtype='object')

In [17]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    6 non-null      object
 1   Age     6 non-null      int64
 2   Marks   6 non-null      int64
dtypes: int64(2), object(1)
memory usage: 276.0+ bytes

In [18]:
df.describe()

             Age      Marks
count   6.000000   6.000000
mean   37.500000  85.500000
std     9.354143   5.576737
min    25.000000  78.000000
25%    31.250000  81.250000
50%    37.500000  86.500000
75%    43.750000  89.500000
max    50.000000  92.000000

In [19]:
df["Name"]

0        Aman
1        Amit
2       Ankit
3      Ankush
4    Abhishek
5        Abhi
Name: Name, dtype: object

In [20]:
df[["Name", "Marks"]]

       Name  Marks
0      Aman     85
1      Amit     90
2     Ankit     78
3    Ankush     88
4  Abhishek     92
5      Abhi     80

In [21]:
df[df["Marks"] > 80]

       Name  Age  Marks
0      Aman   25     85
1      Amit   30     90
3    Ankush   40     88
4  Abhishek   45     92

In [22]:
df[(df["Marks"] > 85) & (df["Age"] > 30)]

       Name  Age  Marks
3    Ankush   40     88
4  Abhishek   45     92

In [23]:
df.sort_values("Marks", ascending=False)

       Name  Age  Marks
4  Abhishek   45     92
1      Amit   30     90
3    Ankush   40     88
0      Aman   25     85
5      Abhi   50     80
2     Ankit   35     78

In [24]:
df["Age"].value_counts()

Age
25    1
30    1
35    1
40    1
45    1
50    1
Name: count, dtype: int64

In [25]:
df = pd.DataFrame({
"Name": ["Aman","Amit","Ankit","Ankush","Abhishek",None,"Abhi"],
"Age": [25, None, 35, None, 45, 50, None],
"Marks": [85, 90, 78, 88, 92, None, 80]})
df

       Name   Age  Marks
0      Aman  25.0   85.0
1      Amit   NaN   90.0
2     Ankit  35.0   78.0
3    Ankush   NaN   88.0
4  Abhishek  45.0   92.0
5      None  50.0    NaN
6      Abhi   NaN   80.0

In [26]:
df.isnull()

    Name    Age  Marks
0  False  False  False
1  False   True  False
2  False  False  False
3  False   True  False
4  False  False  False
5   True  False   True
6  False   True  False

In [27]:
df.isnull().sum()

Name     1
Age      3
Marks    1
dtype: int64

In [28]:
df.dropna()

       Name   Age  Marks
0      Aman  25.0   85.0
2     Ankit  35.0   78.0
4  Abhishek  45.0   92.0

In [29]:
print(df)

       Name   Age  Marks
0      Aman  25.0   85.0
1      Amit   NaN   90.0
2     Ankit  35.0   78.0
3    Ankush   NaN   88.0
4  Abhishek  45.0   92.0
5      None  50.0    NaN
6      Abhi   NaN   80.0

In [30]:
cleaned_data = df.dropna()
print(cleaned_data)

       Name   Age  Marks
0      Aman  25.0   85.0
2     Ankit  35.0   78.0
4  Abhishek  45.0   92.0